<template>
  <div class="container full">
    <div class="row1 w1480vh dfc">
      <div class="dfc">
        <div class="stlinecourseup d-flex">
          <ul class="ul d-flex">
            <li class="p14 cpurple ma">
              <router-link to="/"> Главная </router-link>
            </li>
            <img
              class="w2424 ma"
              src="../../assets/else/chevron-right.png"
              alt=""
            />
            <li class="p14 gray ma">Блог</li>
          </ul>
        </div>
        <div class="ndlinecourse">
          <h1 class="m0">
            FAQ 
          </h1>
          <p class="p20medium c585858">
           Часто задаваемые вопросы
          </p>
          <div class="list_lang gap15 mt30">
            <button class="btn h34w69">Все</button>
            <button class="newsu p5_20 fit c4F4F4F">Вопросы об обучении</button>
            <button class="newsu p5_20 fit c4F4F4F">Вопросы о покупке</button>
          </div>
        </div>
      </div>
      <div class="row mt28faq ">
        <FaqItem class="mb10" v-for="(item, index) in list" :key="index" :faq="item"
      list="list"
      />
      </div>
    <div class="row meditation mt80 w1440h540">

      <col-6 class="col-md-12 ma">
        <img src="../../assets/img/FAQ.png" alt="" />
      </col-6>
      <col-6 class="col-md-12 mtb158">
      <div class="faqviewone">

        <h2 class="h54 ">Мы всегда рады помочь!
        </h2>
      
          <div class="dfc">
            
            <div class="pas grey p20medium ml0 mt15mb40">
              Свяжитесь с нашей командой поддержки <br> студентов по любым вопросам.
            </div>
            <button class="btn p18semibold">Задать вопрос</button>
          </div>
      </div>
      </col-6>
      </div>
    </div>
  </div>
</template>

<script>
    import FaqItem from '@/components/home/faq/FaqItem.vue';
export default {
 components:{
    FaqItem,
 },
  data() {
        return {
            list:[
                {question:"Как проходит обучение на онлайн-курсах?",
                answer:"Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала."},
                
                {question:"Как проходит обучение на онлайн-курсах?",
                answer:"Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала."},
                
                {question:"Как проходит обучение на онлайн-курсах?",
                answer:"Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала."},
                
                {question:"Как проходит обучение на онлайн-курсах?",
                answer:"Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала."},
                
                {question:"Как проходит обучение на онлайн-курсах?",
                answer:"Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала."}
            ]
        }
    },
};
</script>
<style lang="scss" scoped>
@import "../../styles/views/faqview";
</style>
